Revit 2027 API
BuiltInFailures.CurtainGridFamilyFailures.CornerMullionsNeighborsMustBeTangent Property
 Corner Mullions must be placed at a location that can have neighboring Panels that are not tangent. With the exception of Wall Join locations, Corner Mullions are not currently supported on the external boundaries of Curtain elements.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CornerMullionsNeighborsMustBeTangent { get; }
Public Shared ReadOnly Property CornerMullionsNeighborsMustBeTangent As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CornerMullionsNeighborsMustBeTangent {
	FailureDefinitionId^ get ();
}
static member CornerMullionsNeighborsMustBeTangent : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CurtainGridFamilyFailures Class
Autodesk.Revit.DB Namespace